Thesis_Work/Generate_blockMeshDict/rectangle/original/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                |                                                  |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox            |
|  \    /   O peration     | Version:  5                                      |
|   \  /    A nd           | Web:      www.OpenFOAM.org                       |
|    \/     M anipulation  |                                                  |
\*---------------------------------------------------------------------------*/
FoamFile
{
   version     2.0;
   format      ascii;
   class       dictionary;
   object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 -0.05)
    (4.0 0 -0.05)
    (0 0.25 -0.05)
    (4.0 0.25 -0.05)
    (4.5 0.25 -0.05)
    (0 1 -0.05)
    (4.0 1 -0.05)
    (4.5 1 -0.05)
    (0 0 0.05)
    (4.0 0 0.05)
    (0 0.25 0.05)
    (4.0 0.25 0.05)
    (4.5 0.25 0.05)
    (0 1 0.05)
    (4.0 1 0.05)
    (4.5 1 0.05)
    (15 0.25 -0.05)
    (15 1 -0.05)
    (4.5 0 -0.05)
    (15 0 -0.05)
    (15 0.25 0.05)
    (15 1 0.05)
    (4.5 0 0.05)
    (15 0 0.05)
    (0 0.625 0.05)
    (0 0.625 -0.05)
    (4.0 0.625 0.05)
    (4.0 0.625 -0.05)
    (4.5 0.625 0.05)
    (4.5 0.625 -0.05)
    (15 0.625 0.05)
    (15 0.625 -0.05)
);

blocks
(
    hex (0 1 3 2 8 9 11 10) (360 20 1) simpleGrading (0.333 1 1)
    hex (2 3 27 25 10 11 26 24) (360 60 1) simpleGrading (0.333 3.0 1)
    hex (25 27 6 5 24 26 14 13) (360 60 1) simpleGrading (0.333 0.3333333333333333 1)
    hex (3 4 29 27 11 12 28 26) (40 60 1) simpleGrading (1 3.0 1)
    hex (27 29 7 6 26 28 15 14) (40 60 1) simpleGrading (1 0.3333333333333333 1)
    hex (4 16 31 29 12 20 30 28) (800 60 1) simpleGrading (3 3.0 1)
    hex (29 31 17 7 28 30 21 15) (800 60 1) simpleGrading (3 0.3333333333333333 1)
    hex (18 19 16 4 22 23 20 12) (800 20 1) simpleGrading (3 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 8 10 2)
            (2 10 24 25)
            (25 24 13 5)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (19 16 20 23)
		 (16 31 30 20)
		 (30 31 17 21)
        );
    }
    top
    {
        type wall;
        faces
        (
            (5 13 14 6)
            (6 14 15 7)
            (17 7 15 21)
        );
    }
    obstacle
    {
        type wall;
        faces
        (
            (1 3 11 9)
            (3 4 12 11)
            (4 18 22 12)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
